"""
    Реализовать 2 модуля. Названия про выбору - произвольные.
    Каждый модуль содержит функцию возвращающую краткое описание модуля в виде строки. Описание придумать.
    Каждый модуль при загрузке должен выводить предупреждение (warning) с описанием модуля.

"""
from module1 import *
from module2 import *

print("Все модули импортированы")
